
"""

    __iadd__(self, other)
    Сложение с присваиванием.
    
    __isub__(self, other)
    Вычитание с присваиванием.

    __imul__(self, other)
    Умножение с присваиванием.

    __ifloordiv__(self, other)
    Целочисленное деление с присваиванием, оператор //=.

    __idiv__(self, other)
    Деление с присваиванием, оператор /=.

    __itruediv__(self, other)
    Правильное деление с присваиванием. Заметьте, что работает только если используется from __future__ import division.

    __imod_(self, other)
    Остаток от деления с присваиванием, оператор %=.

    __ipow__
    Возведение в степерь с присваиванием, оператор **=.

    __ilshift__(self, other)
    Двоичный сдвиг влево с присваиванием, оператор <<=.

    __irshift__(self, other)
    Двоичный сдвиг вправо с присваиванием, оператор >>=.

    __iand__(self, other)
    Двоичное И с присваиванием, оператор &=.

    __ior__(self, other)
    Двоичное ИЛИ с присваиванием, оператор |=.

    __ixor__(self, other)
    Двоичный xor с присваиванием, оператор ^=.


"""