
"""
    __radd__(self, other)
    Отражённое сложение.

    __rsub__(self, other)
    Отражённое вычитание.

    __rmul__(self, other)
    Отражённое умножение.

    __rfloordiv__(self, other)
    Отражённое целочисленное деление, оператор //.

    __rdiv__(self, other)
    Отражённое деление, оператор /.

    __rtruediv__(self, other)
    Отражённое правильное деление. Заметьте, что работает только когда используется from __future__ import division.

    __rmod__(self, other)
    Отражённый остаток от деления, оператор %.

    __rdivmod__(self, other)
    Определяет поведение для встроенной функции divmod(), когда вызывается divmod(other, self).

    __rpow__
    Отражённое возведение в степерь, оператор **.

    __rlshift__(self, other)
    Отражённый двоичный сдвиг влево, оператор <<.

    __rrshift__(self, other)
    Отражённый двоичный сдвиг вправо, оператор >>.

    __rand__(self, other)
    Отражённое двоичное И, оператор &.

    __ror__(self, other)
    Отражённое двоичное ИЛИ, оператор |.

    __rxor__(self, other)
    Отражённый двоичный xor, оператор ^.

"""