
"""

    __pos__(self)
    Определяет поведение для унарного плюса (+some_object)

    __neg__(self)
    Определяет поведение для отрицания(-some_object)

    __abs__(self)
    Определяет поведение для встроенной функции abs().

    __invert__(self)
    Определяет поведение для инвертирования оператором ~. 

    __round__(self, n)
    Определяет поведение для встроенной функции round(). n это число знаков после запятой, до которого округлить.

    __floor__(self)
    Определяет поведение для math.floor(), то есть, округления до ближайшего меньшего целого.

    __ceil__(self)
    Определяет поведение для math.ceil(), то есть, округления до ближайшего большего целого.

    __trunc__(self)
    Определяет поведение для math.trunc(), то есть, обрезания до целого.


"""